w6d3/routes_and_controllers/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:name,:email))
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "potato"], ["email", "potato@gmail.com"], ["created_at", "2020-12-29 22:41:09.349704"], ["updated_at", "2020-12-29 22:41:09.349704"]]