Career Quest/practice projects/bencher/app/controllers/api/benches_controller.rb

    def create
        @bench = Bench.create!(bench_params)
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at", "seating") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "A sick bench"], ["lat", 37.7912015208027], ["lng", -122.43782043457031], ["created_at", "2021-05-22 00:02:51.717948"], ["updated_at", "2021-05-22 00:02:51.717948"], ["seating", 5]]